; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v11)
             (pred_10 ?v6 ?v13)
             (pred_7 ?v9 ?v13)
             (pred_3 ?v10 ?v9 )
	     (pred_8 ?v9)
             (pred_5 ?v3)
             (pred_11 ?v6)
             (pred_4 ?v13)
             (pred_2 ?v9)
             (pred_12 ?v6)
             (pred_6 ?v9)
             (pred_1 ))



(:action op_1
:parameters (?v5 ?v8 ?v7 ?v1)
:precondition (and (pred_5 ?v5) (pred_5 ?v8) (pred_11 ?v7) (pred_4 ?v1)
          (pred_9 ?v5 ?v8) (pred_10 ?v7 ?v1)
                   (pred_7 ?v8 ?v1) (pred_8 ?v5) 
                   (pred_2 ?v8) (pred_12 ?v7))
:effect (and  (pred_6 ?v8) (not (pred_2 ?v8))))


(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_5 ?v5) (pred_5 ?v2)
               (pred_8 ?v5) (pred_9 ?v5 ?v2) (pred_6 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v5))))

(:action op_4
:parameters (?v5 ?v7)
:precondition (and (pred_5 ?v5) (pred_11 ?v7) 
                  (pred_8 ?v5) (pred_3 ?v7 ?v5) (pred_1 ))
:effect (and (pred_12 ?v7)
   (not (pred_3 ?v7 ?v5)) (not (pred_1 ))))


(:action op_2
:parameters (?v5 ?v12 ?v4)
:precondition (and (pred_5 ?v5) (pred_11 ?v12) (pred_11 ?v4)
                  (pred_8 ?v5) (pred_12 ?v4) (pred_3 ?v12 ?v5))
:effect (and (pred_12 ?v12) (pred_3 ?v4 ?v5)
        (not (pred_12 ?v4)) (not (pred_3 ?v12 ?v5))))

(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_5 ?v5) (pred_11 ?v7) 
                  (pred_8 ?v5) (pred_12 ?v7))
:effect (and (pred_1 ) (pred_3 ?v7 ?v5) (not (pred_12 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_14 obj_10 obj_09 obj_25 obj_13 obj_12 obj_29 obj_26 obj_23 obj_30 obj_08 obj_05 obj_27 obj_07 obj_16 obj_20 obj_04 obj_03 obj_06 obj_11 obj_22 obj_21 obj_28 obj_15
    obj_17 obj_24
    obj_02 obj_19 obj_01
    )

    (:init
       (pred_1)

       (pred_5 obj_18)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_09)
       (pred_5 obj_25)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_29)
       (pred_5 obj_26)
       (pred_5 obj_23)
       (pred_5 obj_30)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_5 obj_27)
       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_03)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_28)
       (pred_5 obj_15)
       (pred_4 obj_17)
       (pred_4 obj_24)
       (pred_11 obj_02)
       (pred_11 obj_19)
       (pred_11 obj_01)

       (pred_9 obj_18 obj_13)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_10 obj_29)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_09 obj_26)
       (pred_9 obj_09 obj_25)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_25 obj_23)
       (pred_9 obj_25 obj_09)
       (pred_9 obj_13 obj_30)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_12 obj_29)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_29 obj_05)
       (pred_9 obj_29 obj_26)
       (pred_9 obj_29 obj_10)
       (pred_9 obj_29 obj_12)
       (pred_9 obj_26 obj_27)
       (pred_9 obj_26 obj_23)
       (pred_9 obj_26 obj_09)
       (pred_9 obj_26 obj_29)
       (pred_9 obj_23 obj_07)
       (pred_9 obj_23 obj_25)
       (pred_9 obj_23 obj_26)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_08)
       (pred_9 obj_30 obj_13)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_05)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_30)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_27)
       (pred_9 obj_05 obj_29)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_07)
       (pred_9 obj_27 obj_26)
       (pred_9 obj_27 obj_05)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_23)
       (pred_9 obj_07 obj_27)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_20 obj_22)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_04 obj_21)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_03 obj_28)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_11 obj_22)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_22 obj_21)
       (pred_9 obj_22 obj_20)
       (pred_9 obj_22 obj_11)
       (pred_9 obj_21 obj_28)
       (pred_9 obj_21 obj_04)
       (pred_9 obj_21 obj_22)
       (pred_9 obj_28 obj_15)
       (pred_9 obj_28 obj_03)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_15 obj_28)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_06)
       (pred_7  obj_20 obj_17)
       (pred_7  obj_21 obj_24)
       (pred_7  obj_06 obj_24)
       (pred_6 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_10)
       (pred_6 obj_09)
       (pred_6 obj_25)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_29)
       (pred_6 obj_26)
       (pred_6 obj_23)
       (pred_6 obj_30)
       (pred_6 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_27)
       (pred_6 obj_07)
       (pred_6 obj_16)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_22)
       (pred_6 obj_28)
       (pred_6 obj_15)

       (pred_10  obj_02 obj_17)
       (pred_10  obj_19 obj_24)
       (pred_10  obj_01 obj_24)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_01 obj_11)
       (pred_8 obj_28)
    )

    (:goal (and
       (pred_3 obj_02 obj_23)
       (pred_3 obj_19 obj_13)
    ))
(:constraints
  (always (not (pred_8 obj_26)))
)
)

; plan
1. (op_5 obj_28 obj_03)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_03)
   goals met: 0 of 2
2. (op_5 obj_03 obj_04)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_04)
   goals met: 0 of 2
3. (op_4 obj_04 obj_02)
   deleted: (pred_3 obj_02 obj_04) (pred_1)
   added: (pred_12 obj_02)
   goals met: 0 of 2
4. (op_5 obj_04 obj_05)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_05)
   goals met: 0 of 2
5. (op_5 obj_05 obj_29)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_29)
   goals met: 0 of 2
6. (op_5 obj_29 obj_10)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_10)
   goals met: 0 of 2
7. (op_5 obj_10 obj_09)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_09)
   goals met: 0 of 2
8. (op_5 obj_09 obj_25)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_25)
   goals met: 0 of 2
9. (op_5 obj_25 obj_23)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_23)
   goals met: 0 of 2
10. (op_3 obj_23 obj_02)
   deleted: (pred_12 obj_02)
   added: (pred_1) (pred_3 obj_02 obj_23)
   goals met: 1 of 2
11. (op_5 obj_23 obj_25)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_25)
   goals met: 1 of 2
12. (op_5 obj_25 obj_09)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_09)
   goals met: 1 of 2
13. (op_5 obj_09 obj_10)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_10)
   goals met: 1 of 2
14. (op_4 obj_10 obj_19)
   deleted: (pred_3 obj_19 obj_10) (pred_1)
   added: (pred_12 obj_19)
   goals met: 1 of 2
15. (op_5 obj_10 obj_14)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_14)
   goals met: 1 of 2
16. (op_5 obj_14 obj_18)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_18)
   goals met: 1 of 2
17. (op_5 obj_18 obj_13)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_13)
   goals met: 1 of 2
18. (op_3 obj_13 obj_19)
   deleted: (pred_12 obj_19)
   added: (pred_1) (pred_3 obj_19 obj_13)
   goals met: 2 of 2
